//Strings metods

//ES5
.charAt()-връща символ
.charCodeAt() - въръща Unicode номер за ES5
.sort() - сортира даден string
.indexOf() -връща първия индекс в който е намерен даден елемент елемент, или -1 ако не е намерен
.map() - връща нов масив с резултатите от условието на функцията за всеки елемент от масива
.trim() - премахва празното пространство между strings
.test() - търси съвпадения в string, връща true или false
.match()- извлича съвпадения в string с изполване на регулярен израз
.toString() - връща string, предсатвляващ определен обект
.toFixed(2)-форматира номер след десетичната запетая
.bind()-създава нова функция,като свързва this с определена последователност от аргументи //bind(this)
instanceof- проверява дали прототипа на обкета е обвързан с прототипа на конструктора
.call()-извиква функция с дадена this стойност и аргументи, представени по отделно
.apply()-извиква функция с дадена this стойност и аргументи, представени като масив
.reduce()-прилага функция върху всяка стойност в масив от ляво на дясно, за да сведе масива до една единствена стойност


//ES6
.codePointAt() - връща Unicode номер за ES6, съответства на charCodeAt()
String.fromCodePoint() - връща символ по даден Unicode номер
.normalize() - ("NFC"),("NFD"),("NFKC"),("NFKD")- нормализира Unicode формите
.includes() - връща true, ако даден текст е намерен в рамките на даден string и false ако не е намерен
.statrWith() -връща true, ако даден текст е намерен в началото на даден string и false ако не е намерен
.repeat() - връща оригиналния string повторен определен брой пъти
.exec() - търси за съвпадения в string, връща съвпадащия текст или 0, ако не е намерен
.source - връща оригиналния string
.flags- връща флаговете в регулярния израз
``- template literal- вкючва многоредови strings
`${ }`-template literal- заместване
String.raw - връща необработената string форма на template literal
rest / spread - (...) - позволява представяне на неограничен брой аргументи, като масив //(object, ...keys)
new.target-определя дали функция или конструктор се извикват с new, като връща препретка към тях //if (typeof new.target !== "undefined")